app/views/devise/registrations/new.html.erb

          <div class="col-md-12">
            <p class="col-md-4"><%= image_tag("front/normal/#{Pokemon.find(1).id}.png") %> Bulbasaur <%= f.radio_button :starter, 1 %> </p>
---
SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT 1  [["id", 1]]