app/controllers/items_controller.rb

    def set_item
      @item = Item.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 0]]