app/controllers/pages_controller.rb

  def inventory
    @items = Item.all
    @myitems = TrainersItem.where(trainer_id: current_user.id)
---
SELECT "items".* FROM "items"
SELECT "trainers_items".* FROM "trainers_items" WHERE "trainers_items"."trainer_id" = ?  [["trainer_id", 57]]

  def pokedex
    @pokemons = Pokemon.all
    @mypokemon = TrainersPokemon.where(trainer_id: current_user.id)
---
SELECT "pokemons".* FROM "pokemons"
SELECT  "trainers_pokemons".* FROM "trainers_pokemons" WHERE "trainers_pokemons"."trainer_id" = ? LIMIT 1  [["trainer_id", 50]]

  def pokemart
    @items = Item.all

    @items.each do |item|
      if params[item.name].to_i != 0
        buy_item(Item.find_by(name: item.name).id, params[item.name].to_i)
---
SELECT "items".* FROM "items"
SELECT  "items".* FROM "items" WHERE "items"."name" = ? LIMIT 1  [["name", "Potion"]]

  def pokemon
    @pokemon = Pokemon.find(params[:pokemon_id])
---
SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT 1  [["id", 1]]

  def pokemon_team
    @mypokemon = TrainersPokemon.where(trainer_id: current_user.id)
---
SELECT  "trainers_pokemons".* FROM "trainers_pokemons" WHERE "trainers_pokemons"."trainer_id" = ? LIMIT 1  [["trainer_id", 50]]