app/controllers/trainers_controller.rb

INSERT INTO "trainers_pokemons" ("trainer_id", "pokemon_id", "pokemon_position", "exp", "shiny", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["trainer_id", 53], ["pokemon_id", 4], ["pokemon_position", 1], ["exp", 0], ["shiny", 0], ["created_at", "2016-05-16 03:48:53.035776"], ["updated_at", "2016-05-16 03:48:53.035776"]]
SELECT "items".* FROM "items"
INSERT INTO "trainers_items" ("trainer_id", "item_id", "qty", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["trainer_id", 56], ["item_id", 1], ["qty", 5], ["created_at", "2016-05-16 03:54:32.117723"], ["updated_at", "2016-05-16 03:54:32.117723"]]
---
  def setup

    if new_user?
      ownership = TrainersPokemon.new
      ownership.trainer_id = current_user.id
      ownership.pokemon_id = current_user.starter
      ownership.pokemon_position = 1
      ownership.exp = 0
      ownership.shiny = 0
      ownership.shiny = 1 if is_shiny
      ownership.save

      Item.all.each do |item|
        ownership = TrainersItem.new
        ownership.trainer_id = current_user.id
        ownership.item_id = item.id
        if (item.id == 1) || (item.id == 5)
          ownership.qty = 5
        else
          ownership.qty = 0
        end
        ownership.save